SteveLRojas/mcu_libs/CH552/CH552_HID_KEYBOARD/main.c
#include "CH552.H"
#include "CH552_RCC.h"
#include "CH552_GPIO.h"
#include "CH552_UART.h"
#include "CH552_TIMER.h"
#include "CH552_USB_HID_KB.h"

#define  BAUD_RATE  125000ul

char code test_string[] = "Unicorn\n";
char code str_bad_command[] = "Bad command!\n";

//Pins:
// LED2 = P16
// LED3 = P17
// RXD = P30
// TXD = P31
// UDP = P36
// UDM = P37

char code hex_table[16] = {0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x41, 0x42, 0x43, 0x44, 0x45, 0x46};

void byte_to_hex(UINT8 value, char* buff)
{
	buff[0] = hex_table[(value >> 4) & 0x0f];
	buff[1] = hex_table[(value) & 0x0f];
	buff[2] = '\0';
}

int main()
{
	char last_keep_str[4];
	UINT8 datagram[2];
	UINT8 temp;
	UINT8 count;
	
	rcc_set_clk_freq(RCC_CLK_FREQ_24M);
	gpio_set_mode(GPIO_MODE_PP, GPIO_PORT_1, GPIO_PIN_6 | GPIO_PIN_7);
	gpio_set_mode(GPIO_MODE_PP, GPIO_PORT_3, GPIO_PIN_1);
	gpio_set_mode(GPIO_MODE_INPUT, GPIO_PORT_3, GPIO_PIN_0);
	
	uart0_init(TIMER_1, BAUD_RATE, UART_0_P30_P31);
	timer_init(TIMER_0, NULL);
	timer_set_period(TIMER_0, FREQ_SYS / 1000ul);	//period is 1ms
	timer_init(TIMER_2, NULL);
	timer_set_period(TIMER_2, 4ul * FREQ_SYS / 1000ul);	//period is 4ms
	EA = 1;	//enable interupts
	E_DIS = 0;
	
	//Blink LED once
	gpio_clear_pin(GPIO_PORT_1, GPIO_PIN_6);
	timer_long_delay(TIMER_0, 250);
	gpio_set_pin(GPIO_PORT_1, GPIO_PIN_6);
	timer_long_delay(TIMER_0, 250);
	uart_write_string(UART_0, test_string);
	
	byte_to_hex(RESET_KEEP, last_keep_str);
	last_keep_str[2] = '\n';
	last_keep_str[3] = '\0';
	uart_write_string(UART_0, last_keep_str);
	
	hid_kb_init();
	timer_start(TIMER_2);
	
	while(TRUE)
	{
		if(uart_bytes_available(UART_0) >= 2)
		{
			temp = uart_peek(UART_0);
			if((temp == '\r') || (temp == '\n'))
			{
				(void)uart_read_byte(UART_0);
				continue;
			}
			
			uart_read_bytes(UART_0, datagram, 2);
			for(count = 0; count < 2; ++count)
			{
				temp = datagram[count];
				if(temp >= '0' && temp <= '9')  //convert numbers
					temp = temp - '0';
				else if(temp >= 'A' && temp <= 'F')   //convert uppercase letters
					temp = temp - 'A' + 10;
				else if(temp >= 'a' && temp <= 'f')   //convert the annoying lowercase letters
					temp = temp - 'a' + 10;
				else
					continue;

				RESET_KEEP = RESET_KEEP << 4;
				RESET_KEEP = RESET_KEEP | temp;
			}
			
			gpio_write_pin(GPIO_PORT_1, GPIO_PIN_7, !gpio_read_pin(GPIO_PORT_1, GPIO_PIN_7));
			if(RESET_KEEP == 0xFF)
			{
				hid_kb_press_modifier(HID_KB_MOD_RIGHT_GUI);
				timer_long_delay(TIMER_0, 100);
				hid_kb_release_modifier(HID_KB_MOD_RIGHT_GUI);
			}
			else
			{
				hid_kb_press_key(RESET_KEEP);
				timer_long_delay(TIMER_0, 100);
				hid_kb_release_key(RESET_KEEP);
			}
			gpio_write_pin(GPIO_PORT_1, GPIO_PIN_6, gpio_read_pin(GPIO_PORT_1, GPIO_PIN_7));
		}
		
		if(hid_kb_idle_rate && ((UINT8)timer_overflow_counts[TIMER_2] >= hid_kb_idle_rate))
		{
			hid_kb_send_report();
			timer_overflow_counts[TIMER_2] = 0;
		}
	}
}

